OpenFOAM-master/of-xp/OpenFOAM-2.3.1/tutorials/multiphase/driftFluxFoam/ras/tank3D/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    SYMP3
    {
        type            slip;
    }

    INLE1
    {
        type            calculated;
        value           $internalField;
    }

    "OUTL.*"
    {
        type            calculated;
        value           $internalField;
    }

    "WALL.*"
    {
        type            nutkWallFunction;
        value           $internalField;
    }
}


// ************************************************************************* //
